artt_app_api/app/controllers/pasts_controller.rb

SELECT "pasts".* FROM "pasts"
---
  def index
    @pasts = Past.all