artt_app_api/app/controllers/presents_controller.rb

  def index
    @presents = Present.all
---
SELECT "presents".* FROM "presents"