app/controllers/futures_controller.rb

  def index
    @futures = Future.all
---
SELECT "futures".* FROM "futures"

  def create
    @future = Future.new(future_params)

    if @future.save
---
INSERT INTO "futures" ("title", "description", "created_at", "updated_at", "date") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "This is a coold title"], ["description", " Location: In the woods "], ["created_at", "2019-06-04 13:34:58.919824"], ["updated_at", "2019-06-04 13:34:58.919824"], ["date", "4/4/19"]]

  def destroy
    @future.destroy
---
DELETE FROM "futures" WHERE "futures"."id" = $1  [["id", 33]]

    def set_future
      @future = Future.find(params[:id])
---
SELECT  "futures".* FROM "futures" WHERE "futures"."id" = $1 LIMIT $2  [["id", 33], ["LIMIT", 1]]